dict={
    "G1569":['北京南-上海虹桥','07:00','13:30','6h30m',553.5],
    "D3124":['上海虹桥-杭州东','09:00','10:00','1h0m',185.0],
    "Z98":['北京-广州','18:00','06:30','12h30m',422.5],
    "T162":['广州-成都','15:00','05:30','14h30m',398.0],
    "K512":['成都-拉萨','08:00','22:00','14h0m',512.0]
}
print("车次\t出发地-目的地\t出发时间 到达时间 历时 票价（元）")
for key in dict:
    print(f"{key}\t{dict[key][0]}\t{dict[key][1]}\t{dict[key][2]}\t{dict[key][3]}\t{dict[key][4]}")
train_no=input("请输入要购买的车次：")
info=dict.get(train_no,'没有该车次信息，请重新输入')
if info != '没有该车次信息，请重新输入':
    print(f"您已成功购买{train_no}次列车，{info[0]}，出发时间{info[1]}，到达时间{info[2]}，历时{info[3]}，票价{info[4]}元")